- **Terraform formatting and style 🖌 ``**
- **Terraform initialization ⚙️ `success`**
- **Terraform plan 📖 `success`**
- **Terraform validation 🤖 `success`**
<details><summary>Show plan output</summary>
```

module.processing_queue["dev"].data.archive_file.processing_lambda_source: Reading...
module.processing_queue["prod"].data.archive_file.processing_lambda_source: Reading...
module.frontend_bucket["dev"].aws_iam_policy.upload_user_policy: Refreshing state... [id=arn:aws:iam::990658861879:policy/kickin-media-frontend-dev-upload-policy]
module.frontend_bucket["prod"].aws_iam_user.upload_user: Refreshing state... [id=kickin-media-frontend-prod-upload-user]
module.frontend_bucket["prod"].aws_iam_policy.upload_user_policy: Refreshing state... [id=arn:aws:iam::990658861879:policy/kickin-media-frontend-prod-upload-policy]
module.frontend_bucket["dev"].aws_iam_user_policy_attachment.upload_user_attachment: Refreshing state... [id=kickin-media-frontend-dev-upload-user-20221120083912757500000001]
module.frontend_bucket["prod"].aws_s3_bucket.frontend_s3_bucket: Refreshing state... [id=kickin-media-frontend-prod]
module.frontend_bucket["dev"].aws_iam_user.upload_user: Refreshing state... [id=kickin-media-frontend-dev-upload-user]
module.frontend_bucket["prod"].aws_iam_user_policy_attachment.upload_user_attachment: Refreshing state... [id=kickin-media-frontend-prod-upload-user-20221120083912762100000002]
module.photo_bucket["prod"].aws_s3_bucket.photo_s3_bucket: Refreshing state... [id=kickin-media-photo-prod]
module.processing_queue["prod"].data.aws_iam_policy_document.lambda-trust-policy: Reading...
module.frontend_bucket["dev"].aws_s3_bucket.frontend_s3_bucket: Refreshing state... [id=kickin-media-frontend-dev]
module.processing_queue["prod"].data.aws_iam_policy_document.lambda-trust-policy: Read complete after 0s [id=2690255455]
module.processing_queue["dev"].data.aws_iam_policy_document.lambda-trust-policy: Reading...
module.frontend_bucket["prod"].aws_cloudfront_origin_access_identity.frontend_oai: Refreshing state... [id=E25UK2ZATDNFS6]
module.processing_queue["dev"].data.aws_iam_policy_document.lambda-trust-policy: Read complete after 0s [id=2690255455]
module.frontend_bucket["dev"].aws_cloudfront_origin_access_identity.frontend_oai: Refreshing state... [id=E38IC32PF933UN]
module.photo_bucket["dev"].aws_s3_bucket.photo_s3_bucket: Refreshing state... [id=kickin-media-photo-dev]
module.frontend_bucket["prod"].data.aws_iam_openid_connect_provider.example: Reading...
module.frontend_bucket["dev"].data.aws_iam_openid_connect_provider.example: Reading...
module.processing_queue["dev"].data.archive_file.processing_lambda_source: Read complete after 0s [id=7e3356ddb8ccc887d1b4bd8f2960837b15ed029d]
module.processing_queue["prod"].data.archive_file.processing_lambda_source: Read complete after 0s [id=7e3356ddb8ccc887d1b4bd8f2960837b15ed029d]
module.processing_queue["prod"].aws_sqs_queue.photo-processing-queue-dlq: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/990658861879/media-photo-processing-prod-dlq]
module.processing_queue["dev"].aws_sqs_queue.photo-processing-queue-dlq: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/990658861879/media-photo-processing-dev-dlq]
module.frontend_bucket["prod"].data.aws_iam_openid_connect_provider.example: Read complete after 0s [id=arn:aws:iam::990658861879:oidc-provider/token.actions.githubusercontent.com]
aws_s3_bucket.mysql_backup_bucket: Refreshing state... [id=kickin-media-db-backup]
module.frontend_bucket["dev"].data.aws_iam_openid_connect_provider.example: Read complete after 1s [id=arn:aws:iam::990658861879:oidc-provider/token.actions.githubusercontent.com]
module.photo_bucket["prod"].aws_cloudfront_origin_access_identity.photo_oai: Refreshing state... [id=EOH3ANZHA17JI]
module.photo_bucket["dev"].aws_cloudfront_origin_access_identity.photo_oai: Refreshing state... [id=E9UIM00KKJQDD]
module.processing_queue["prod"].aws_iam_role.lambda-execution-role: Refreshing state... [id=media-photo-processing-prod-execution-role]
module.processing_queue["dev"].aws_iam_role.lambda-execution-role: Refreshing state... [id=media-photo-processing-dev-execution-role]
module.processing_queue["prod"].aws_lambda_function.processing_lambda: Refreshing state... [id=photo-processing-lambda-prod]
module.processing_queue["dev"].aws_lambda_function.processing_lambda: Refreshing state... [id=photo-processing-lambda-dev]
module.processing_queue["dev"].aws_sqs_queue.photo-processing-queue: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/990658861879/media-photo-processing-dev]
module.processing_queue["prod"].aws_sqs_queue.photo-processing-queue: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/990658861879/media-photo-processing-prod]
module.processing_queue["dev"].data.aws_iam_policy_document.lambda-role-policy-document: Reading...
module.processing_queue["prod"].data.aws_iam_policy_document.lambda-role-policy-document: Reading...
module.processing_queue["dev"].data.aws_iam_policy_document.lambda-role-policy-document: Read complete after 0s [id=3013688695]
module.processing_queue["prod"].data.aws_iam_policy_document.lambda-role-policy-document: Read complete after 0s [id=4101266900]
module.processing_queue["prod"].aws_iam_policy.lambda-role-policy: Refreshing state... [id=arn:aws:iam::990658861879:policy/media-photo-processing-prod-processing-policy]
module.processing_queue["dev"].aws_iam_policy.lambda-role-policy: Refreshing state... [id=arn:aws:iam::990658861879:policy/media-photo-processing-dev-processing-policy]
module.processing_queue["prod"].aws_iam_role_policy_attachment.lambda-execution-role-policy: Refreshing state... [id=media-photo-processing-prod-execution-role-20221120084244149900000001]
module.processing_queue["dev"].aws_iam_role_policy_attachment.lambda-execution-role-policy: Refreshing state... [id=media-photo-processing-dev-execution-role-20221120084244157600000002]
module.processing_queue["prod"].aws_lambda_event_source_mapping.processing_lambda_event_mapping: Refreshing state... [id=c3cd01e2-f797-41cb-b3db-b9c9d7845375]
module.processing_queue["dev"].aws_lambda_event_source_mapping.processing_lambda_event_mapping: Refreshing state... [id=baa3f7b1-602f-47be-a922-182b0975efd6]
module.frontend_bucket["dev"].data.aws_iam_policy_document.frontend_allow_cloudfront: Reading...
module.frontend_bucket["dev"].aws_s3_bucket_ownership_controls.s3_bucket_acl_ownership: Refreshing state... [id=kickin-media-frontend-dev]
module.frontend_bucket["prod"].aws_s3_bucket_ownership_controls.s3_bucket_acl_ownership: Refreshing state... [id=kickin-media-frontend-prod]
module.frontend_bucket["prod"].data.aws_iam_policy_document.frontend_allow_cloudfront: Reading...
module.frontend_bucket["dev"].aws_s3_bucket_public_access_block.frontend_s3_bucket_public_acl: Refreshing state... [id=kickin-media-frontend-dev]
module.frontend_bucket["prod"].aws_s3_bucket_public_access_block.frontend_s3_bucket_public_acl: Refreshing state... [id=kickin-media-frontend-prod]
module.frontend_bucket["dev"].data.aws_iam_policy_document.frontend_allow_cloudfront: Read complete after 0s [id=1929207177]
module.frontend_bucket["prod"].data.aws_iam_policy_document.frontend_allow_cloudfront: Read complete after 0s [id=4179026155]
module.frontend_bucket["dev"].aws_s3_bucket_website_configuration.frontend_s3_bucket_website_configuration: Refreshing state... [id=kickin-media-frontend-dev]
module.frontend_bucket["prod"].aws_s3_bucket_website_configuration.frontend_s3_bucket_website_configuration: Refreshing state... [id=kickin-media-frontend-prod]
module.frontend_bucket["dev"].aws_cloudfront_distribution.frontend_cloudfront_distribution: Refreshing state... [id=E3VQB16JMRSNQE]
module.frontend_bucket["prod"].aws_cloudfront_distribution.frontend_cloudfront_distribution: Refreshing state... [id=E1IUXQS0ADPZ3N]
module.frontend_bucket["prod"].aws_s3_bucket_policy.frontend_s3_bucket_policy: Refreshing state... [id=kickin-media-frontend-prod]
module.frontend_bucket["dev"].aws_s3_bucket_policy.frontend_s3_bucket_policy: Refreshing state... [id=kickin-media-frontend-dev]
module.photo_bucket["prod"].aws_iam_policy.upload_user_policy: Refreshing state... [id=arn:aws:iam::990658861879:policy/kickin-media-photo-prod-upload-policy]
module.photo_bucket["dev"].aws_iam_policy.upload_user_policy: Refreshing state... [id=arn:aws:iam::990658861879:policy/kickin-media-photo-dev-upload-policy]
module.photo_bucket["prod"].aws_s3_bucket_public_access_block.photo_s3_bucket_public_acl: Refreshing state... [id=kickin-media-photo-prod]
module.photo_bucket["dev"].aws_s3_bucket_public_access_block.photo_s3_bucket_public_acl: Refreshing state... [id=kickin-media-photo-dev]
module.photo_bucket["prod"].aws_iam_user.upload_user: Refreshing state... [id=kickin-media-photo-prod-upload-user]
module.photo_bucket["dev"].aws_iam_user.upload_user: Refreshing state... [id=kickin-media-photo-dev-upload-user]
module.photo_bucket["prod"].aws_s3_bucket_website_configuration.photo_s3_bucket_website_configuration: Refreshing state... [id=kickin-media-photo-prod]
module.photo_bucket["dev"].aws_s3_bucket_website_configuration.photo_s3_bucket_website_configuration: Refreshing state... [id=kickin-media-photo-dev]
module.photo_bucket["prod"].data.aws_iam_policy_document.photo_allow_cloudfront: Reading...
module.photo_bucket["prod"].aws_s3_bucket_lifecycle_configuration.photo_s3_bucket_lifecycle: Refreshing state... [id=kickin-media-photo-prod]
module.photo_bucket["dev"].data.aws_iam_policy_document.photo_allow_cloudfront: Reading...
module.photo_bucket["dev"].aws_s3_bucket_lifecycle_configuration.photo_s3_bucket_lifecycle: Refreshing state... [id=kickin-media-photo-dev]
module.photo_bucket["prod"].data.aws_iam_policy_document.photo_allow_cloudfront: Read complete after 0s [id=3513791596]
module.photo_bucket["dev"].data.aws_iam_policy_document.photo_allow_cloudfront: Read complete after 0s [id=1632310300]
aws_s3_bucket_acl.mysql_s3_bucket_acl: Refreshing state... [id=kickin-media-db-backup,private]
aws_iam_user.mysql_backup_upload_user: Refreshing state... [id=kickin-media-db-backup-db-backup-user]
aws_s3_bucket_public_access_block.mysql_s3_bucket_public_acl: Refreshing state... [id=kickin-media-db-backup]
aws_s3_bucket_lifecycle_configuration.mysql_s3_bucket_lifecycle: Refreshing state... [id=kickin-media-db-backup]
aws_iam_policy.mysql_backup_upload_user_policy: Refreshing state... [id=arn:aws:iam::990658861879:policy/kickin-media-db-backup-db-backup-policy]
module.frontend_bucket["dev"].aws_s3_bucket_acl.frontend_s3_bucket_acl: Refreshing state... [id=kickin-media-frontend-dev,private]
module.frontend_bucket["prod"].aws_s3_bucket_acl.frontend_s3_bucket_acl: Refreshing state... [id=kickin-media-frontend-prod,private]
module.photo_bucket["prod"].aws_s3_bucket_policy.photo_s3_bucket_policy: Refreshing state... [id=kickin-media-photo-prod]
module.photo_bucket["dev"].aws_s3_bucket_policy.photo_s3_bucket_policy: Refreshing state... [id=kickin-media-photo-dev]
module.photo_bucket["prod"].aws_iam_user_policy_attachment.upload_user_attachment: Refreshing state... [id=kickin-media-photo-prod-upload-user-20221120083913170700000004]
module.photo_bucket["dev"].aws_iam_user_policy_attachment.upload_user_attachment: Refreshing state... [id=kickin-media-photo-dev-upload-user-20221120083913161200000003]
aws_iam_user_policy_attachment.mysql_backup_user_attachment: Refreshing state... [id=kickin-media-db-backup-db-backup-user-20221120084011901900000001]
module.photo_bucket["dev"].aws_cloudfront_response_headers_policy.photo_cloudfront_response_headers_policy: Refreshing state... [id=7d4a0748-46fc-4d77-a913-950c8c064fdb]
module.photo_bucket["prod"].aws_cloudfront_response_headers_policy.photo_cloudfront_response_headers_policy: Refreshing state... [id=7d3cab49-f03d-4856-80ce-2e997f5b5f40]
module.photo_bucket["prod"].aws_s3_bucket_cors_configuration.photo_s3_bucket_cors: Refreshing state... [id=kickin-media-photo-prod]
module.photo_bucket["dev"].aws_s3_bucket_cors_configuration.photo_s3_bucket_cors: Refreshing state... [id=kickin-media-photo-dev]
module.photo_bucket["dev"].aws_cloudfront_distribution.photo_cloudfront_distribution: Refreshing state... [id=EJRIX53CDQ2GO]
module.photo_bucket["prod"].aws_cloudfront_distribution.photo_cloudfront_distribution: Refreshing state... [id=E1OUOQKS00XMR3]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.frontend_bucket["dev"].aws_iam_policy.upload_role_policy will be created
  + resource "aws_iam_policy" "upload_role_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "kickin-media-frontend-dev-upload-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:PutObjectAcl",
                          + "s3:GetObject",
                          + "s3:HeadObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::kickin-media-frontend-dev/*"
                    },
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::kickin-media-frontend-dev"
                    },
                  + {
                      + Action   = "cloudfront:CreateInvalidation"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:cloudfront::990658861879:distribution/E3VQB16JMRSNQE"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.frontend_bucket["dev"].aws_iam_policy.upload_user_policy will be destroyed
  # (because aws_iam_policy.upload_user_policy is not in configuration)
  - resource "aws_iam_policy" "upload_user_policy" {
      - arn              = "arn:aws:iam::990658861879:policy/kickin-media-frontend-dev-upload-policy" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::990658861879:policy/kickin-media-frontend-dev-upload-policy" -> null
      - name             = "kickin-media-frontend-dev-upload-policy" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:PutObjectAcl",
                          - "s3:GetObject",
                          - "s3:HeadObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::kickin-media-frontend-dev/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::kickin-media-frontend-dev"
                    },
                  - {
                      - Action   = "cloudfront:CreateInvalidation"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cloudfront::990658861879:distribution/E3VQB16JMRSNQE"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPA6NJ66TM3YVIUI2HZR" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.frontend_bucket["dev"].aws_iam_role.frontend_upload_role will be created
  + resource "aws_iam_role" "frontend_upload_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:kickin-media/media-front-end:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::990658861879:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "kickin-media-frontend-dev-upload-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.frontend_bucket["dev"].aws_iam_role_policy_attachment.upload_role_attachment will be created
  + resource "aws_iam_role_policy_attachment" "upload_role_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "kickin-media-frontend-dev-upload-role"
    }

  # module.frontend_bucket["dev"].aws_iam_user.upload_user will be destroyed
  # (because aws_iam_user.upload_user is not in configuration)
  - resource "aws_iam_user" "upload_user" {
      - arn                  = "arn:aws:iam::990658861879:user/kickin-media-frontend-dev-upload-user" -> null
      - id                   = "kickin-media-frontend-dev-upload-user" -> null
      - name                 = "kickin-media-frontend-dev-upload-user" -> null
      - path                 = "/" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null
      - unique_id            = "AIDA6NJ66TM3YRAXOKLEB" -> null
        # (1 unchanged attribute hidden)
    }

  # module.frontend_bucket["dev"].aws_iam_user_policy_attachment.upload_user_attachment will be destroyed
  # (because aws_iam_user_policy_attachment.upload_user_attachment is not in configuration)
  - resource "aws_iam_user_policy_attachment" "upload_user_attachment" {
      - id         = "kickin-media-frontend-dev-upload-user-20221120083912757500000001" -> null
      - policy_arn = "arn:aws:iam::990658861879:policy/kickin-media-frontend-dev-upload-policy" -> null
      - user       = "kickin-media-frontend-dev-upload-user" -> null
    }

  # module.frontend_bucket["prod"].aws_iam_policy.upload_role_policy will be created
  + resource "aws_iam_policy" "upload_role_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "kickin-media-frontend-prod-upload-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:PutObjectAcl",
                          + "s3:GetObject",
                          + "s3:HeadObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::kickin-media-frontend-prod/*"
                    },
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::kickin-media-frontend-prod"
                    },
                  + {
                      + Action   = "cloudfront:CreateInvalidation"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:cloudfront::990658861879:distribution/E1IUXQS0ADPZ3N"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.frontend_bucket["prod"].aws_iam_policy.upload_user_policy will be destroyed
  # (because aws_iam_policy.upload_user_policy is not in configuration)
  - resource "aws_iam_policy" "upload_user_policy" {
      - arn              = "arn:aws:iam::990658861879:policy/kickin-media-frontend-prod-upload-policy" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::990658861879:policy/kickin-media-frontend-prod-upload-policy" -> null
      - name             = "kickin-media-frontend-prod-upload-policy" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:PutObjectAcl",
                          - "s3:GetObject",
                          - "s3:HeadObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::kickin-media-frontend-prod/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::kickin-media-frontend-prod"
                    },
                  - {
                      - Action   = "cloudfront:CreateInvalidation"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cloudfront::990658861879:distribution/E1IUXQS0ADPZ3N"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPA6NJ66TM36O7LF6DAI" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.frontend_bucket["prod"].aws_iam_role.frontend_upload_role will be created
  + resource "aws_iam_role" "frontend_upload_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:kickin-media/media-front-end:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::990658861879:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "kickin-media-frontend-prod-upload-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.frontend_bucket["prod"].aws_iam_role_policy_attachment.upload_role_attachment will be created
  + resource "aws_iam_role_policy_attachment" "upload_role_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "kickin-media-frontend-prod-upload-role"
    }

  # module.frontend_bucket["prod"].aws_iam_user.upload_user will be destroyed
  # (because aws_iam_user.upload_user is not in configuration)
  - resource "aws_iam_user" "upload_user" {
      - arn                  = "arn:aws:iam::990658861879:user/kickin-media-frontend-prod-upload-user" -> null
      - id                   = "kickin-media-frontend-prod-upload-user" -> null
      - name                 = "kickin-media-frontend-prod-upload-user" -> null
      - path                 = "/" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null
      - unique_id            = "AIDA6NJ66TM35QZMZOYKW" -> null
        # (1 unchanged attribute hidden)
    }

  # module.frontend_bucket["prod"].aws_iam_user_policy_attachment.upload_user_attachment will be destroyed
  # (because aws_iam_user_policy_attachment.upload_user_attachment is not in configuration)
  - resource "aws_iam_user_policy_attachment" "upload_user_attachment" {
      - id         = "kickin-media-frontend-prod-upload-user-20221120083912762100000002" -> null
      - policy_arn = "arn:aws:iam::990658861879:policy/kickin-media-frontend-prod-upload-policy" -> null
      - user       = "kickin-media-frontend-prod-upload-user" -> null
    }

  # module.processing_queue["dev"].aws_lambda_function.processing_lambda will be updated in-place
  ~ resource "aws_lambda_function" "processing_lambda" {
        id                             = "photo-processing-lambda-dev"
      ~ last_modified                  = "2025-04-10T08:17:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "7SBkJ1Kh/97fTSX7zDo7lbpOW7BQx+5ELtdsVNuI+sU=" -> "Dbqj+/S4XPrng8W6mJn7FMSklMF5Ermt8+o0bnu+sp0="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.processing_queue["prod"].aws_lambda_function.processing_lambda will be updated in-place
  ~ resource "aws_lambda_function" "processing_lambda" {
        id                             = "photo-processing-lambda-prod"
      ~ last_modified                  = "2025-04-10T08:16:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "7SBkJ1Kh/97fTSX7zDo7lbpOW7BQx+5ELtdsVNuI+sU=" -> "Dbqj+/S4XPrng8W6mJn7FMSklMF5Ermt8+o0bnu+sp0="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 6 to add, 2 to change, 6 to destroy.

Warning: Invalid Attribute Combination

  with aws_s3_bucket_lifecycle_configuration.mysql_s3_bucket_lifecycle,
  on mysql-backup.tf line 17, in resource "aws_s3_bucket_lifecycle_configuration" "mysql_s3_bucket_lifecycle":
  17: resource "aws_s3_bucket_lifecycle_configuration" "mysql_s3_bucket_lifecycle" {

No attribute specified when one (and only one) of
[rule[0].filter,rule[0].prefix] is required

This will be an error in a future version of the provider

(and 4 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @jonathanjuursema*